una1veritas/Workspace/IAR/arm/inc/Freescale/MK50N512CMD100.h
/*! \} */ /* end of group FTM_Peripheral */


/* ----------------------------------------------------------------------------
   -- I2C
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2C_Peripheral I2C */
/*! \{ */

/*! I2C - Peripheral register structure */
typedef struct I2C_MemMap {
  uint8_t A1;                                      /*!< I2C Address Register 1, offset: 0x0 */
  uint8_t F;                                       /*!< I2C Frequency Divider register, offset: 0x1 */
  uint8_t C1;                                      /*!< I2C Control Register 1, offset: 0x2 */
  uint8_t S;                                       /*!< I2C Status Register, offset: 0x3 */
  uint8_t D;                                       /*!< I2C Data I/O register, offset: 0x4 */
  uint8_t C2;                                      /*!< I2C Control Register 2, offset: 0x5 */
  uint8_t FLT;                                     /*!< I2C Programmable Input Glitch Filter register, offset: 0x6 */
  uint8_t RA;                                      /*!< I2C Range Address register, offset: 0x7 */
  uint8_t SMB;                                     /*!< I2C SMBus Control and Status register, offset: 0x8 */
  uint8_t A2;                                      /*!< I2C Address Register 2, offset: 0x9 */
  uint8_t SLTH;                                    /*!< I2C SCL Low Timeout Register High, offset: 0xA */
  uint8_t SLTL;                                    /*!< I2C SCL Low Timeout Register Low, offset: 0xB */
} volatile *I2C_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- I2C - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2C_Register_Accessor_Macros I2C - Register accessor macros */
/*! \{ */


/* I2C - Register accessors */
#define I2C_A1_REG(base)                         ((base)->A1)
#define I2C_F_REG(base)                          ((base)->F)
#define I2C_C1_REG(base)                         ((base)->C1)
#define I2C_S_REG(base)                          ((base)->S)
#define I2C_D_REG(base)                          ((base)->D)
#define I2C_C2_REG(base)                         ((base)->C2)
#define I2C_FLT_REG(base)                        ((base)->FLT)
#define I2C_RA_REG(base)                         ((base)->RA)
#define I2C_SMB_REG(base)                        ((base)->SMB)
#define I2C_A2_REG(base)                         ((base)->A2)
#define I2C_SLTH_REG(base)                       ((base)->SLTH)
#define I2C_SLTL_REG(base)                       ((base)->SLTL)

/*! \} */ /* end of group I2C_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- I2C Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2C_Register_Masks I2C Register Masks */
/*! \{ */

/* A1 Bit Fields */
#define I2C_A1_AD_MASK                           0xFEu
#define I2C_A1_AD_SHIFT                          1
#define I2C_A1_AD(x)                             (((uint8_t)(((uint8_t)(x))<<I2C_A1_AD_SHIFT))&I2C_A1_AD_MASK)
/* F Bit Fields */
#define I2C_F_ICR_MASK                           0x3Fu
#define I2C_F_ICR_SHIFT                          0
#define I2C_F_ICR(x)                             (((uint8_t)(((uint8_t)(x))<<I2C_F_ICR_SHIFT))&I2C_F_ICR_MASK)
#define I2C_F_MULT_MASK                          0xC0u
#define I2C_F_MULT_SHIFT                         6
#define I2C_F_MULT(x)                            (((uint8_t)(((uint8_t)(x))<<I2C_F_MULT_SHIFT))&I2C_F_MULT_MASK)
/* C1 Bit Fields */
#define I2C_C1_DMAEN_MASK                        0x1u
#define I2C_C1_DMAEN_SHIFT                       0
#define I2C_C1_WUEN_MASK                         0x2u
#define I2C_C1_WUEN_SHIFT                        1
#define I2C_C1_RSTA_MASK                         0x4u
#define I2C_C1_RSTA_SHIFT                        2
#define I2C_C1_TXAK_MASK                         0x8u
#define I2C_C1_TXAK_SHIFT                        3
#define I2C_C1_TX_MASK                           0x10u
#define I2C_C1_TX_SHIFT                          4
#define I2C_C1_MST_MASK                          0x20u
#define I2C_C1_MST_SHIFT                         5
#define I2C_C1_IICIE_MASK                        0x40u
#define I2C_C1_IICIE_SHIFT                       6
#define I2C_C1_IICEN_MASK                        0x80u
#define I2C_C1_IICEN_SHIFT                       7
/* S Bit Fields */
#define I2C_S_RXAK_MASK                          0x1u
#define I2C_S_RXAK_SHIFT                         0
#define I2C_S_IICIF_MASK                         0x2u
#define I2C_S_IICIF_SHIFT                        1
#define I2C_S_SRW_MASK                           0x4u
#define I2C_S_SRW_SHIFT                          2
#define I2C_S_RAM_MASK                           0x8u
#define I2C_S_RAM_SHIFT                          3
#define I2C_S_ARBL_MASK                          0x10u
#define I2C_S_ARBL_SHIFT                         4
#define I2C_S_BUSY_MASK                          0x20u
#define I2C_S_BUSY_SHIFT                         5
#define I2C_S_IAAS_MASK                          0x40u
#define I2C_S_IAAS_SHIFT                         6
#define I2C_S_TCF_MASK                           0x80u
#define I2C_S_TCF_SHIFT                          7
/* D Bit Fields */
#define I2C_D_DATA_MASK                          0xFFu
#define I2C_D_DATA_SHIFT                         0
#define I2C_D_DATA(x)                            (((uint8_t)(((uint8_t)(x))<<I2C_D_DATA_SHIFT))&I2C_D_DATA_MASK)
/* C2 Bit Fields */
#define I2C_C2_AD_MASK                           0x7u
#define I2C_C2_AD_SHIFT                          0
#define I2C_C2_AD(x)                             (((uint8_t)(((uint8_t)(x))<<I2C_C2_AD_SHIFT))&I2C_C2_AD_MASK)
#define I2C_C2_RMEN_MASK                         0x8u
#define I2C_C2_RMEN_SHIFT                        3
#define I2C_C2_SBRC_MASK                         0x10u
#define I2C_C2_SBRC_SHIFT                        4
#define I2C_C2_HDRS_MASK                         0x20u
#define I2C_C2_HDRS_SHIFT                        5
#define I2C_C2_ADEXT_MASK                        0x40u
#define I2C_C2_ADEXT_SHIFT                       6
#define I2C_C2_GCAEN_MASK                        0x80u
#define I2C_C2_GCAEN_SHIFT                       7
/* FLT Bit Fields */
#define I2C_FLT_FLT_MASK                         0x1Fu
#define I2C_FLT_FLT_SHIFT                        0
#define I2C_FLT_FLT(x)                           (((uint8_t)(((uint8_t)(x))<<I2C_FLT_FLT_SHIFT))&I2C_FLT_FLT_MASK)
/* RA Bit Fields */
#define I2C_RA_RAD_MASK                          0xFEu
#define I2C_RA_RAD_SHIFT                         1
#define I2C_RA_RAD(x)                            (((uint8_t)(((uint8_t)(x))<<I2C_RA_RAD_SHIFT))&I2C_RA_RAD_MASK)
/* SMB Bit Fields */
#define I2C_SMB_SHTF2IE_MASK                     0x1u
#define I2C_SMB_SHTF2IE_SHIFT                    0
#define I2C_SMB_SHTF2_MASK                       0x2u
#define I2C_SMB_SHTF2_SHIFT                      1
#define I2C_SMB_SHTF1_MASK                       0x4u
#define I2C_SMB_SHTF1_SHIFT                      2
#define I2C_SMB_SLTF_MASK                        0x8u
#define I2C_SMB_SLTF_SHIFT                       3
#define I2C_SMB_TCKSEL_MASK                      0x10u
#define I2C_SMB_TCKSEL_SHIFT                     4
#define I2C_SMB_SIICAEN_MASK                     0x20u
#define I2C_SMB_SIICAEN_SHIFT                    5
#define I2C_SMB_ALERTEN_MASK                     0x40u
#define I2C_SMB_ALERTEN_SHIFT                    6
#define I2C_SMB_FACK_MASK                        0x80u
#define I2C_SMB_FACK_SHIFT                       7
/* A2 Bit Fields */
#define I2C_A2_SAD_MASK                          0xFEu
#define I2C_A2_SAD_SHIFT                         1
#define I2C_A2_SAD(x)                            (((uint8_t)(((uint8_t)(x))<<I2C_A2_SAD_SHIFT))&I2C_A2_SAD_MASK)
/* SLTH Bit Fields */
#define I2C_SLTH_SSLT_MASK                       0xFFu
#define I2C_SLTH_SSLT_SHIFT                      0
#define I2C_SLTH_SSLT(x)                         (((uint8_t)(((uint8_t)(x))<<I2C_SLTH_SSLT_SHIFT))&I2C_SLTH_SSLT_MASK)
/* SLTL Bit Fields */
#define I2C_SLTL_SSLT_MASK                       0xFFu
#define I2C_SLTL_SSLT_SHIFT                      0
#define I2C_SLTL_SSLT(x)                         (((uint8_t)(((uint8_t)(x))<<I2C_SLTL_SSLT_SHIFT))&I2C_SLTL_SSLT_MASK)

/*! \} */ /* end of group I2C_Register_Masks */


/* I2C - Peripheral instance base addresses */
/*! Peripheral I2C0 base pointer */
#define I2C0_BASE_PTR                            ((I2C_MemMapPtr)0x40066000u)
/*! Peripheral I2C1 base pointer */
#define I2C1_BASE_PTR                            ((I2C_MemMapPtr)0x40067000u)

/* ----------------------------------------------------------------------------
   -- I2C - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2C_Register_Accessor_Macros I2C - Register accessor macros */
/*! \{ */


/* I2C - Register instance definitions */
/* I2C0 */
#define I2C0_A1                                  I2C_A1_REG(I2C0_BASE_PTR)
#define I2C0_F                                   I2C_F_REG(I2C0_BASE_PTR)
#define I2C0_C1                                  I2C_C1_REG(I2C0_BASE_PTR)
#define I2C0_S                                   I2C_S_REG(I2C0_BASE_PTR)
#define I2C0_D                                   I2C_D_REG(I2C0_BASE_PTR)
#define I2C0_C2                                  I2C_C2_REG(I2C0_BASE_PTR)
#define I2C0_FLT                                 I2C_FLT_REG(I2C0_BASE_PTR)
#define I2C0_RA                                  I2C_RA_REG(I2C0_BASE_PTR)
#define I2C0_SMB                                 I2C_SMB_REG(I2C0_BASE_PTR)
#define I2C0_A2                                  I2C_A2_REG(I2C0_BASE_PTR)
#define I2C0_SLTH                                I2C_SLTH_REG(I2C0_BASE_PTR)
#define I2C0_SLTL                                I2C_SLTL_REG(I2C0_BASE_PTR)
/* I2C1 */
#define I2C1_A1                                  I2C_A1_REG(I2C1_BASE_PTR)
#define I2C1_F                                   I2C_F_REG(I2C1_BASE_PTR)
#define I2C1_C1                                  I2C_C1_REG(I2C1_BASE_PTR)
#define I2C1_S                                   I2C_S_REG(I2C1_BASE_PTR)
#define I2C1_D                                   I2C_D_REG(I2C1_BASE_PTR)
#define I2C1_C2                                  I2C_C2_REG(I2C1_BASE_PTR)
#define I2C1_FLT                                 I2C_FLT_REG(I2C1_BASE_PTR)
#define I2C1_RA                                  I2C_RA_REG(I2C1_BASE_PTR)
#define I2C1_SMB                                 I2C_SMB_REG(I2C1_BASE_PTR)
#define I2C1_A2                                  I2C_A2_REG(I2C1_BASE_PTR)
#define I2C1_SLTH                                I2C_SLTH_REG(I2C1_BASE_PTR)
#define I2C1_SLTL                                I2C_SLTL_REG(I2C1_BASE_PTR)

/*! \} */ /* end of group I2C_Register_Accessor_Macros */


/*! \} */ /* end of group I2C_Peripheral */


/* ----------------------------------------------------------------------------
   -- I2S
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2S_Peripheral I2S */
/*! \{ */

/*! I2S - Peripheral register structure */
typedef struct I2S_MemMap {
  uint32_t TX0;                                    /*!< I2S Transmit Data Registers 0, offset: 0x0 */
  uint32_t TX1;                                    /*!< I2S Transmit Data Registers 1, offset: 0x4 */
  uint32_t RX0;                                    /*!< I2S Receive Data Registers 0, offset: 0x8 */
  uint32_t RX1;                                    /*!< I2S Receive Data Registers 1, offset: 0xC */
  uint32_t CR;                                     /*!< I2S Control Register, offset: 0x10 */
  uint32_t ISR;                                    /*!< I2S Interrupt Status Register, offset: 0x14 */
  uint32_t IER;                                    /*!< I2S Interrupt Enable Register, offset: 0x18 */
  uint32_t TCR;                                    /*!< I2S Transmit Configuration Register, offset: 0x1C */
  uint32_t RCR;                                    /*!< I2S Receive Configuration Register, offset: 0x20 */
  uint32_t TCCR;                                   /*!< I2S Transmit Clock Control Registers, offset: 0x24 */
  uint32_t RCCR;                                   /*!< I2S Receive Clock Control Registers, offset: 0x28 */
  uint32_t FCSR;                                   /*!< I2S FIFO Control/Status Register, offset: 0x2C */
  uint8_t RESERVED_0[8];
  uint32_t ACNT;                                   /*!< I2S AC97 Control Register, offset: 0x38 */
  uint32_t ACADD;                                  /*!< I2S AC97 Command Address Register, offset: 0x3C */
  uint32_t ACDAT;                                  /*!< I2S AC97 Command Data Register, offset: 0x40 */
  uint32_t ATAG;                                   /*!< I2S AC97 Tag Register, offset: 0x44 */
  uint32_t TMSK;                                   /*!< I2S Transmit Time Slot Mask Register, offset: 0x48 */
  uint32_t RMSK;                                   /*!< I2S Receive Time Slot Mask Register, offset: 0x4C */
  uint32_t ACCST;                                  /*!< I2S AC97 Channel Status Register, offset: 0x50 */
  uint32_t ACCEN;                                  /*!< I2S AC97 Channel Enable Register, offset: 0x54 */
  uint32_t ACCDIS;                                 /*!< I2S AC97 Channel Disable Register, offset: 0x58 */
} volatile *I2S_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- I2S - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup I2S_Register_Accessor_Macros I2S - Register accessor macros */
/*! \{ */


/* I2S - Register accessors */
#define I2S_TX0_REG(base)                        ((base)->TX0)
#define I2S_TX1_REG(base)                        ((base)->TX1)
#define I2S_RX0_REG(base)                        ((base)->RX0)
#define I2S_RX1_REG(base)                        ((base)->RX1)
#define I2S_CR_REG(base)                         ((base)->CR)
#define I2S_ISR_REG(base)                        ((base)->ISR)
#define I2S_IER_REG(base)                        ((base)->IER)
#define I2S_TCR_REG(base)                        ((base)->TCR)
#define I2S_RCR_REG(base)                        ((base)->RCR)
#define I2S_TCCR_REG(base)                       ((base)->TCCR)
#define I2S_RCCR_REG(base)                       ((base)->RCCR)
#define I2S_FCSR_REG(base)                       ((base)->FCSR)
#define I2S_ACNT_REG(base)                       ((base)->ACNT)
#define I2S_ACADD_REG(base)                      ((base)->ACADD)
#define I2S_ACDAT_REG(base)                      ((base)->ACDAT)
#define I2S_ATAG_REG(base)                       ((base)->ATAG)
#define I2S_TMSK_REG(base)                       ((base)->TMSK)
#define I2S_RMSK_REG(base)                       ((base)->RMSK)
#define I2S_ACCST_REG(base)                      ((base)->ACCST)
#define I2S_ACCEN_REG(base)                      ((base)->ACCEN)
#define I2S_ACCDIS_REG(base)                     ((base)->ACCDIS)

/*! \} */ /* end of group I2S_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- I2S Register Masks
   ---------------------------------------------------------------------------- */

